Poundy-Github/MFCJ3_IntegratePlatform/00_BOOT/03_MFC5J3_FBL/00_Tresos/demos/Bootloader/8.7.1-TC38XQ/demoBoot_OemInd_canfd_asr/source/config/Platforms_MemMap_BL.h
/*  Used for flash driver start */
#elif (defined FLASH_FLS_START_SEC_CODE)
   #undef      FLASH_FLS_START_SEC_CODE
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section CODE ".fls_driver"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section text = ".fls_driver" 
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".fls_driver")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_softune)
      #pragma segment FAR_CODE=RAMCODE
      #pragma segment CODE=RAMCODE
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
      #if (TS_ARCH_FAMILY == TS_S12X)
		#pragma CODE_SEG fls_driver
	  #elif (TS_ARCH_FAMILY == TS_S12Z)
	    #pragma CODE_SEG fls_driver
      #else
        #pragma push
        #pragma section code_type ".fls_driver"
      #endif
	#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_cosmic)
	  #pragma section (fls_driver)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_ccs)
      #ifdef FLASH_FLS_RAM_FUNC
        #pragma CODE_SECTION(FLASH_FLS_RAM_FUNC,"ramfuncs")
      #endif
      #ifdef FLASH_OPERATION_CBK
        #pragma CODE_SECTION(FLASH_OPERATION_CBK,"ramfuncs")
      #endif
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_ticgt)
     #ifdef FLASH_FLS_RAM_TMS320F28035_FUNC
       #pragma CODE_SECTION(FLASH_FLS_RAM_TMS320F28035_FUNC,"ramfuncs")
     #endif
     #ifdef FLASH_OPERATION_CBK
       #pragma CODE_SECTION(FLASH_OPERATION_CBK,"ramfuncs");
     #endif
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #if (TS_ARCH_DERIVATE == TS_XC2268)
           #pragma section code=DRV_FLS_WRITE_SEC
        #else

        #endif
    #endif
   #undef MEMMAP_ERROR
#elif (defined FLASH_FLS_STOP_SEC_CODE)
   #undef      FLASH_FLS_STOP_SEC_CODE
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section CODE
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section text = default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_softune)
      #pragma segment FAR_CODE
      #pragma segment CODE
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
      #if (TS_ARCH_FAMILY == TS_S12X)
		#pragma CODE_SEG DEFAULT
	  #elif (TS_ARCH_FAMILY == TS_S12Z)
		#pragma CODE_SEG DEFAULT
      #else
        #pragma pop
      #endif
	#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_cosmic)
	  #pragma section ()
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #if (TS_ARCH_DERIVATE == TS_XC2268)
          #pragma endsection
        #else

        #endif
    #endif
   #undef MEMMAP_ERROR

#elif (defined FLASH_FLS_START_SEC_CONST)
   #undef      FLASH_FLS_START_SEC_CONST
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section CONST ".fls_driver"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".fls_driver")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section rodata = ".fls_driver"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
    #pragma push
    #pragma section const_type ".fls_driver"
    #endif
   #undef MEMMAP_ERROR
#elif (defined FLASH_FLS_STOP_SEC_CONST)
   #undef      FLASH_FLS_STOP_SEC_CONST
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section CODE
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section rodata = default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
     #pragma pop
    #endif
   #undef MEMMAP_ERROR

/*  Used for flash driver end */

/*  Used for RH850 code needed to copy to RAM */
#elif (defined FLASH_START_R_FCL_CODE_USR)
   #undef      FLASH_START_R_FCL_CODE_USR
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
    #pragma ghs section text = ".R_FCL_CODE_USR"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_csp)
     #pragma section text "R_FCL_CODE_USR"
    #endif
   #undef MEMMAP_ERROR
#elif (defined FLASH_STOP_R_FCL_CODE_USR)
   #undef      FLASH_STOP_R_FCL_CODE_USR
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
    #pragma ghs section text = default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_csp)
     #pragma section default
    #endif
   #undef MEMMAP_ERROR

/* Start of History Record */
#elif (defined FLASH_START_RAM_CODE_USR )
   #undef      FLASH_START_RAM_CODE_USR 
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section DATA ".data"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section data = ".data"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
     #pragma section ".myCodeInRAM"
     __declspec(section ".myCodeInRAM")
    #endif
   #undef MEMMAP_ERROR
#elif (defined FLASH_STOP_RAM_CODE_USR )
   #undef      FLASH_STOP_RAM_CODE_USR 
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section DATA
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section data = default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
     /* nothing to do */
    #endif
   #undef MEMMAP_ERROR
/* End of History Record */

/* Start of History Record */
#elif (defined PROG_START_HISTORY_RECORD_SEC_CONST_8 )
   #undef      PROG_START_HISTORY_RECORD_SEC_CONST_8 
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section CONST ".history_record"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section rodata = ".history_record"
    #endif
   #undef MEMMAP_ERROR
#elif (defined PROG_STOP_HISTORY_RECORD_SEC_CONST_8 )
   #undef      PROG_STOP_HISTORY_RECORD_SEC_CONST_8 
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section CONST
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section rodata = default
    #endif
   #undef MEMMAP_ERROR
/* End of History Record */

/*------------------[Start of a module]--------------------------------------*/
#elif (defined APP_COMPSTART_START_SEC_CONST_8)
  #undef APP_COMPSTART_START_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom "CompStart"
      #pragma protect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".CompStart")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=".CompStart"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
        #pragma section RODATA ".CompStart"
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPSTART_STOP_SEC_CONST_8)
  #undef APP_COMPSTART_STOP_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom restore
      #pragma endprotect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=default
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section RODATA
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPADDRSTART_START_SEC_CONST_8)
  #undef APP_COMPADDRSTART_START_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom "CompAddrStart"
      #pragma protect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)  
      __attribute__((section(".CompAddrStart")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=".CompAddrStart"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
        #pragma  section RODATA ".CompAddrStart"
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPADDRSTART_STOP_SEC_CONST_8)
  #undef APP_COMPADDRSTART_STOP_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom restore
      #pragma endprotect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=default
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
        #pragma  section RODATA
    #endif
  #undef MEMMAP_ERROR

