Poundy-Github/MFCJ3_IntegratePlatform/00_BOOT/03_MFC5J3_FBL/00_Tresos/demos/Bootloader/8.7.1-TC38XQ/demoBoot_OemInd_canfd_asr/source/config/Platforms_MemMap_BL.h
#elif (defined APP_COMPADDRCOMPSTART_START_SEC_CONST_8)
  #undef APP_COMPADDRCOMPSTART_START_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom "CompAddCompStart"
      #pragma protect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".CompAddCompStart")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=".CompAddCompStart"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
        #pragma section rodata ".CompAddCompStart"
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPADDRCOMPSTART_STOP_SEC_CONST_8)
  #undef APP_COMPADDRCOMPSTART_STOP_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom restore
      #pragma endprotect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=default
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
        #pragma RODATA
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPADDREND_START_SEC_CONST_8)
  #undef APP_COMPADDREND_START_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom "CompAddrEnd"
      #pragma protect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".CompAddrEnd")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=".CompAddrEnd"

    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section RODATA ".ComAddrEnd"
    #endif
     #undef MEMMAP_ERROR

#elif (defined APP_COMPADDREND_STOP_SEC_CONST_8)
  #undef APP_COMPADDREND_STOP_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom restore
      #pragma endprotect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section RODATA
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPEND_START_SEC_CONST_8)
  #undef APP_COMPEND_START_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom "CompEnd"
      #pragma protect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".CompEnd")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=".CompEnd"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section rodata ".CompEnd"
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPEND_STOP_SEC_CONST_8)
  #undef APP_COMPEND_STOP_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom restore
      #pragma endprotect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section rodata
    #endif

  #undef MEMMAP_ERROR

#elif (defined APP_COMPCONSTTEST_START_SEC_CONST_8)
  #undef APP_COMPCONSTTEST_START_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom "CompConstTest"
      #pragma protect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".CompConstTest")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=".CompConstTest"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
        #pragma section rodata ".CompConstTest"
    #endif

  #undef MEMMAP_ERROR

#elif (defined APP_COMPCONSTTEST_STOP_SEC_CONST_8)
  #undef APP_COMPCONSTTEST_STOP_SEC_CONST_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section farrom restore
      #pragma endprotect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section rodata=default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section rodata
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPCALLOUT_START_SEC_CODE_8)
  #undef APP_COMPCALLOUT_START_SEC_CODE_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section code "CompleteCompatibleCallout"
      #pragma protect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".CompleteCompatibleCallout")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section text=".CompleteCompatibleCallout"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section text ".CompleteCompatibleCallout"
    #endif
  #undef MEMMAP_ERROR

#elif (defined APP_COMPCALLOUT_STOP_SEC_CODE_8)
  #undef APP_COMPCALLOUT_STOP_SEC_CODE_8
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
      #pragma section code restore
      #pragma endprotect
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
      #pragma ghs section text=default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
          #pragma section text
    #endif
  #undef MEMMAP_ERROR

/*------------------[Start of a module]--------------------------------------*/
#elif defined (BM_BOOT_CKS_START_SEC_VAR)
    #undef      BM_BOOT_CKS_START_SEC_VAR
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
		#if (TS_ARCH_DERIVATE == TS_XC2268)
          #pragma  section far="Bootchecksum"
	      #pragma  romdata
	      #pragma  protect
        #else
          #pragma  section farrom "Bootchecksum"
          #pragma protect
        #endif
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".bootchecksum")))
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
        #pragma ghs section rodata = ".bootchecksum"
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
    #endif
    #undef MEMMAP_ERROR
#elif defined (BM_BOOT_CKS_STOP_SEC_VAR)
    #undef      BM_BOOT_CKS_STOP_SEC_VAR
    #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
		#if (TS_ARCH_DERIVATE == TS_XC2268)
		  #pragma endprotect
	      #pragma noromdata
          #pragma endsection
        #else
          #pragma section farrom restore
          #pragma endprotect
        #endif
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
        #pragma ghs section rodata=default
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
    #endif
    #undef MEMMAP_ERROR
  

