Poundy-Github/MFCJ3_IntegratePlatform/00_BOOT/03_MFC5J3_FBL/00_Tresos/demos/Bootloader/8.7.1-TC38XQ/demoBoot_OemInd_canfd_asr/source/config/Platforms_MemMap_BL.h
/*------------------[Start of a module]--------------------------------------*/
#elif defined (PROG_START_SEC_CODE)
   #undef      PROG_START_SEC_CODE
   #undef MEMMAP_ERROR
#elif defined (PROG_STOP_SEC_CODE)
   #undef      PROG_STOP_SEC_CODE
   #undef MEMMAP_ERROR

#elif defined (PROG_GET_DID_F0F3_START_SEC_CODE)
   #undef      PROG_GET_DID_F0F3_START_SEC_CODE
   #undef MEMMAP_ERROR
#elif defined (PROG_GET_DID_F0F3_STOP_SEC_CODE)
   #undef      PROG_GET_DID_F0F3_STOP_SEC_CODE
   #undef MEMMAP_ERROR

#elif defined (PROG_GET_DID_F0F6_START_SEC_CODE)
   #undef      PROG_GET_DID_F0F6_START_SEC_CODE
   #undef MEMMAP_ERROR
#elif defined (PROG_GET_DID_F0F6_STOP_SEC_CODE)
   #undef      PROG_GET_DID_F0F6_STOP_SEC_CODE
   #undef MEMMAP_ERROR

#elif defined (PROG_START_SEC_VAR_INIT_8)
   #undef      PROG_START_SEC_VAR_INIT_8
   #undef MEMMAP_ERROR
#elif defined (PROG_STOP_SEC_VAR_INIT_8)
   #undef      PROG_STOP_SEC_VAR_INIT_8
   #undef MEMMAP_ERROR

#elif defined (PROG_START_SEC_VAR_NO_INIT_8)
   #undef      PROG_START_SEC_VAR_NO_INIT_8

   #undef MEMMAP_ERROR
#elif defined (PROG_STOP_SEC_VAR_NO_INIT_8)
   #undef      PROG_STOP_SEC_VAR_NO_INIT_8
   #undef MEMMAP_ERROR

#elif defined (PROG_START_SEC_VAR_NO_INIT_UNSPECIFIED)
   #undef      PROG_START_SEC_VAR_NO_INIT_UNSPECIFIED
   #undef MEMMAP_ERROR
#elif defined (PROG_STOP_SEC_VAR_NO_INIT_UNSPECIFIED)
   #undef      PROG_STOP_SEC_VAR_NO_INIT_UNSPECIFIED
   #undef MEMMAP_ERROR

#elif defined (PROG_START_SEC_VAR_RAM_NO_INIT)
   #undef      PROG_START_SEC_VAR_RAM_NO_INIT
     #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
     #if (TS_ARCH_DERIVATE == TS_XC2268)
        #pragma section ram_no_init
       #else
        #pragma section farbss ".ram_no_init"
       #endif
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".ram_no_init")))
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
       #pragma ghs section bss=".ram_no_init"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section DATA "" ".ram_no_init"
     #endif
   #undef MEMMAP_ERROR
#elif defined (PROG_STOP_SEC_VAR_RAM_NO_INIT)
   #undef      PROG_STOP_SEC_VAR_RAM_NO_INIT
     #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
     #if (TS_ARCH_DERIVATE == TS_XC2268)
        #pragma endsection
       #else
        #pragma section farbss restore
       #endif

     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
       #pragma ghs section
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
       #pragma section BSS "" ""
     #endif
   #undef MEMMAP_ERROR

#elif defined (PROG_START_SEC_CONST_UNSPECIFIED)
   #undef      PROG_START_SEC_CONST_UNSPECIFIED
   #undef MEMMAP_ERROR
#elif defined (PROG_STOP_SEC_CONST_UNSPECIFIED)
   #undef      PROG_STOP_SEC_CONST_UNSPECIFIED
   #undef MEMMAP_ERROR

#elif defined (PROG_START_SEC_CONST_8)
   #undef      PROG_START_SEC_CONST_8
   #undef MEMMAP_ERROR
#elif defined (PROG_STOP_SEC_CONST_8)
   #undef      PROG_STOP_SEC_CONST_8
   #undef MEMMAP_ERROR

#elif defined (PROG_SBL_HEADER_START_SEC_CONST_8)
   #undef      PROG_SBL_HEADER_START_SEC_CONST_8
   #undef MEMMAP_ERROR
   #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #pragma section farrom "SBLHeader"
       #pragma protect
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".SBLHeader")))
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
       #pragma ghs section rodata=".SBLHeader"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
    #pragma section CONST ".SBLHeader"
     #endif
#elif defined (PROG_SBL_HEADER_STOP_SEC_CONST_8)
   #undef      PROG_SBL_HEADER_STOP_SEC_CONST_8
   #undef MEMMAP_ERROR
   #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
     #pragma  section farrom restore
     #pragma endprotect
     #pragma clear
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section CONST
   #endif

#elif defined (PROG_SBL_VALIDITY_START_SEC_CONST_8)
   #undef      PROG_SBL_VALIDITY_START_SEC_CONST_8
   #undef MEMMAP_ERROR
   #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #pragma section farrom "SBLValidity"
       #pragma protect
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".SBLValidity")))
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
       #pragma ghs section rodata=".SBLValidity"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section CONST ".SBLValidity"
     #endif
#elif defined (PROG_SBL_VALIDITY_STOP_SEC_CONST_8)
   #undef      PROG_SBL_VALIDITY_STOP_SEC_CONST_8
   #undef MEMMAP_ERROR
   #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
     #pragma section farrom restore
     #pragma endprotect
     #pragma clear
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
    #pragma section CONST
   #endif

#elif defined (PROG_REPROG_FLAG_START_SEC_VAR_NO_INIT_8)
   #undef      PROG_REPROG_FLAG_START_SEC_VAR_NO_INIT_8
     #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #if (TS_ARCH_DERIVATE == TS_XC2268)
           #pragma section far=prog_sig
           #pragma protect
        #else
           #pragma section farbss "prog_sig"
           #pragma protect
        #endif
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".prog_sig")))
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
		#if (defined BOARD_V850ESFX3)
		  #pragma ghs section sbss=".prog_sig"
		#else
		  #pragma ghs section bss=".prog_sig"
		#endif
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
       #pragma section DATA "" ".prog_sig"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_softune)
       #pragma segment DATA=prog_sig

     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_ccs)
       #pragma DATA_SECTION(m_ulProgSig,".prog_sig")
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_ticgt)
       #pragma DATA_SECTION(m_ulProgSig,".prog_sig")
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_ticgt)
      #pragma DATA_SECTION(m_ulProgSig,".prog_sig")
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_csp)
		#if (defined BOARD_RL78F1X_GFEGSM)
		  #pragma section bss .prog_sig
		#else
		  #pragma section .prog_sig
		#endif
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
       #if (TS_ARCH_FAMILY == TS_S12X)
		 #pragma DATA_SEG .prog_sig
       #elif (TS_ARCH_FAMILY == TS_S12Z)
		 #pragma DATA_SEG prog_sig
       #else
         #pragma push
         #pragma section data_type ".prog_sig"
	   #endif
	 #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_cosmic)
	   #pragma section [prog_sig]
     #endif
   #undef MEMMAP_ERROR
#elif defined (PROG_REPROG_FLAG_STOP_SEC_VAR_NO_INIT_8)
   #undef      PROG_REPROG_FLAG_STOP_SEC_VAR_NO_INIT_8
   #undef MEMMAP_ERROR
   #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
     #if (TS_ARCH_DERIVATE == TS_XC2268)
         #pragma endprotect
         #pragma endsection
      #else
         #pragma section farbss restore
         #pragma endprotect
      #endif
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section DATA
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_softune)
      #pragma segment DATA=DATA
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_csp)
		#if (defined BOARD_RL78F1X_GFEGSM)
		  #pragma section
		#else
          #pragma section default
		#endif
    #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
      #if (TS_ARCH_FAMILY == TS_S12X)
		#pragma DATA_SEG DEFAULT
      #elif (TS_ARCH_FAMILY == TS_S12Z)
		#pragma DATA_SEG DEFAULT
      #else
        #pragma pop
      #endif
	#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_cosmic)
	  #pragma section []
    #endif
 #elif defined (PROG_ANTISCANNING_START_SEC_VAR_NO_INIT_8)
#undef      PROG_ANTISCANNING_START_SEC_VAR_NO_INIT_8
  #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
    #if (TS_ARCH_DERIVATE == TS_XC2268)
        #pragma section far=prog_sig
        #pragma protect
     #else
        #pragma section farbss "prog_antiscanning"
        #pragma protect
     #endif
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".prog_antiscanning")))
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
 #if (defined BOARD_V850ESFX3)
   #pragma ghs section sbss=".prog_antiscanning"
 #else
   #pragma ghs section bss=".prog_antiscanning"
 #endif
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
    #pragma section DATA "" ".prog_antiscanning"
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_softune)
    #pragma segment DATA=prog_antiscanning

  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_ccs)
    #pragma DATA_SECTION(m_ulProgSig,".prog_antiscanning")
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_ticgt)
    #pragma DATA_SECTION(m_ulProgSig,".prog_antiscanning")
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_ticgt)
    #pragma DATA_SECTION(m_ulProgSig,".prog_antiscanning")
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_csp)
  #if (defined BOARD_RL78F1X_GFEGSM)
    #pragma section bss .prog_antiscanning
  #else
    #pragma section .prog_antiscanning
  #endif
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
    #if (TS_ARCH_FAMILY == TS_S12X)
	  #pragma DATA_SEG .prog_antiscanning
    #elif (TS_ARCH_FAMILY == TS_S12Z)
	  #pragma DATA_SEG prog_antiscanning
    #else
      #pragma push
      #pragma section data_type ".prog_antiscanning"
    #endif
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_cosmic)
    #pragma section [prog_antiscanning]
  #endif
#undef MEMMAP_ERROR
#elif defined (PROG_ANTISCANNING_FLAG_STOP_SEC_VAR_NO_INIT_8)
#undef      PROG_ANTISCANNING_FLAG_STOP_SEC_VAR_NO_INIT_8
#undef MEMMAP_ERROR
#if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
  #if (TS_ARCH_DERIVATE == TS_XC2268)
      #pragma endprotect
      #pragma endsection
   #else
      #pragma section farbss restore
      #pragma endprotect
   #endif
#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
  #pragma ghs section
#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section DATA
#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_softune)
   #pragma segment DATA=DATA
#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_csp)
  #if (defined BOARD_RL78F1X_GFEGSM)
    #pragma section
  #else
    #pragma section default
  #endif
#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_mwerks)
  #if (TS_ARCH_FAMILY == TS_S12X)
    #pragma DATA_SEG DEFAULT
  #elif (TS_ARCH_FAMILY == TS_S12Z)
    #pragma DATA_SEG DEFAULT
  #else
     #pragma pop
  #endif
#elif (PLATFORMS_TOOLCHAIN == PLATFORMS_cosmic)
    #pragma section []
#endif

