Poundy-Github/MFCJ3_IntegratePlatform/00_BOOT/03_MFC5J3_FBL/00_Tresos/demos/Bootloader/8.7.1-TC38XQ/demoBoot_OemInd_canfd_asr/source/config/Platforms_MemMap_BL.h
#elif defined (PROG_TESTER_ADDRESS_FLAG_START_SEC_VAR_NO_INIT_8)
   #undef      PROG_TESTER_ADDRESS_FLAG_START_SEC_VAR_NO_INIT_8
     #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #pragma section farbss "tester_address"
       #pragma protect
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".tester_address")))
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
       #pragma ghs section bss=".tester_address"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
       #pragma section DATA "" ".tester_address"
     #endif
   #undef MEMMAP_ERROR
#elif defined (PROG_TESTER_ADDRESS_FLAG_STOP_SEC_VAR_NO_INIT_8)
   #undef      PROG_TESTER_ADDRESS_FLAG_STOP_SEC_VAR_NO_INIT_8
   #undef MEMMAP_ERROR
   #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
     #pragma section farbss restore
     #pragma endprotect
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section DATA "" ""
   #endif

#elif defined (PROG_ECU_ADDRESS_START_SEC_VAR_NO_INIT_8)
   #undef      PROG_ECU_ADDRESS_START_SEC_VAR_NO_INIT_8
     #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #pragma section farbss "ecu_address"
       #pragma protect
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".ecu_address")))
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
       #pragma ghs section bss=".ecu_address"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
       #pragma section DATA "" ".ecu_address"
     #endif
   #undef MEMMAP_ERROR
#elif defined (PROG_ECU_ADDRESS_STOP_SEC_VAR_NO_INIT_8)
   #undef      PROG_ECU_ADDRESS_STOP_SEC_VAR_NO_INIT_8
   #undef MEMMAP_ERROR
   #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
     #pragma section farbss restore
     #pragma endprotect
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section DATA "" ""
   #endif

#elif defined (PROG_SUPPPOSITIVERESPONSE_FLAG_START_SEC_VAR_NO_INIT_8)
   #undef      PROG_SUPPPOSITIVERESPONSE_FLAG_START_SEC_VAR_NO_INIT_8
     #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #pragma section farbss "applitoboot_response"
       #pragma protect
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
      __attribute__((section(".applitoboot_response")))
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
       #pragma ghs section bss=".applitoboot_response"
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
       #pragma section DATA "" ".applitoboot_response"
     #endif
   #undef MEMMAP_ERROR
#elif defined (PROG_SUPPPOSITIVERESPONSE_FLAG_STOP_SEC_VAR_NO_INIT_8)
   #undef      PROG_SUPPPOSITIVERESPONSE_FLAG_STOP_SEC_VAR_NO_INIT_8
   #undef MEMMAP_ERROR
   #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
     #pragma section farbss restore
     #pragma endprotect
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_gnu)
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_multi)
     #pragma ghs section
   #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
     #pragma section DATA "" ""
   #endif

#elif defined (PROG_BOOT_INFO_START_SEC_CONST_UNSPECIFIED)
   #undef      PROG_BOOT_INFO_START_SEC_CONST_UNSPECIFIED
   #undef MEMMAP_ERROR
#elif defined (PROG_BOOT_INFO_STOP_SEC_CONST_UNSPECIFIED)
   #undef      PROG_BOOT_INFO_STOP_SEC_CONST_UNSPECIFIED
   #undef MEMMAP_ERROR
   
#elif (defined PROG_START_SEC_CODE_FLASH_PAGE)
  #undef PROG_START_SEC_CODE_FLASH_PAGE
  #undef MEMMAP_ERROR
  #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
    #pragma section code="FlashPage"
    #pragma protect
     #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
        #pragma section code "FlashPage"
  #endif

#elif (defined PROG_STOP_SEC_CODE_FLASH_PAGE)
  #undef PROG_STOP_SEC_CODE_FLASH_PAGE
  #undef MEMMAP_ERROR
  #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
    #pragma section code
    #pragma endprotect

  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
      #pragma section code
  #endif

/*****************************************************************************
**                                 EB                                       **
******************************************************************************/
#elif (defined EB_BUFF_TP_WRAP_START_SEC_VAR )
  #undef EB_BUFF_TP_WRAP_START_SEC_VAR
  #undef MEMMAP_ERROR
#elif (defined EB_BUFF_TP_WRAP_STOP_SEC_VAR )
  #undef EB_BUFF_TP_WRAP_STOP_SEC_VAR
  #undef MEMMAP_ERROR
  
#elif (defined EB_FUNCBUFF_TP_WRAP_START_SEC_VAR )
  #undef EB_FUNCBUFF_TP_WRAP_START_SEC_VAR
  #undef MEMMAP_ERROR
#elif (defined EB_FUNCBUFF_TP_WRAP_STOP_SEC_VAR )
  #undef EB_FUNCBUFF_TP_WRAP_STOP_SEC_VAR
  #undef MEMMAP_ERROR
  
#elif (defined EB_PHYSBUFF_TP_WRAP_START_SEC_VAR )
  #undef EB_PHYSBUFF_TP_WRAP_START_SEC_VAR
  #undef MEMMAP_ERROR
#elif (defined EB_PHYSBUFF_TP_WRAP_STOP_SEC_VAR )
  #undef EB_PHYSBUFF_TP_WRAP_STOP_SEC_VAR
  #undef MEMMAP_ERROR
  
/*****************************************************************************
**                               BLPDUR                                       **
******************************************************************************/
#elif (defined BLPDUR_BUFF_START_SEC_VAR )
  #undef BLPDUR_BUFF_START_SEC_VAR
  #undef MEMMAP_ERROR
#elif (defined BLPDUR_BUFF_STOP_SEC_VAR )
  #undef BLPDUR_BUFF_STOP_SEC_VAR
  #undef MEMMAP_ERROR

  /*****************************************************************************
**                                 FLSLOADER                                **
******************************************************************************/

/*
 * To be used for mapping code to application block, boot block,
 * external flash etc
 */
#elif defined (FLSLOADER_START_SEC_CODE)
   #undef      FLSLOADER_START_SEC_CODE
   #undef MEMMAP_ERROR
#elif defined (FLSLOADER_STOP_SEC_CODE)
   #undef      FLSLOADER_STOP_SEC_CODE
   #undef MEMMAP_ERROR
#elif defined (FLSLOADER_START_SEC_WRITE_CODE)
  #if (PLATFORMS_TOOLCHAIN == PLATFORMS_tasking)
       #pragma section code "DRV_FLS_WRITE_SEC"
       #pragma section_name_with_symbol
       #pragma section_name_with_module
  #elif (PLATFORMS_TOOLCHAIN == PLATFORMS_dcc)
    #pragma section CODE ".DRV_FLS_WRITE_SEC"
  #endif

